espressif/esp-idf/components/soc/esp32s31/register/soc/dma2d_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Configuration Registers */
/** Type of out_conf0_chn register
 *  Configures the tx direction of channel n
 */
typedef union {
    struct {
        /** out_auto_wrback_chn : R/W; bitpos: [0]; default: 0;
         *  Set this bit to enable automatic outlink-writeback when all the data pointed by
         *  outlink descriptor has been received.
         */
        uint32_t out_auto_wrback_chn:1;
        /** out_eof_mode_chn : R/W; bitpos: [1]; default: 1;
         *  EOF flag generation mode when receiving data. 1: EOF flag for Tx channel 0 is
         *  generated when data need to read has been popped from FIFO in DMA
         */
        uint32_t out_eof_mode_chn:1;
        /** outdscr_burst_en_chn : R/W; bitpos: [2]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Tx channel 0 reading link
         *  descriptor when accessing internal SRAM.
         */
        uint32_t outdscr_burst_en_chn:1;
        /** out_ecc_aes_en_chn : R/W; bitpos: [3]; default: 0;
         *  When access address space is ecc/aes area, this bit should be set to 1. In this
         *  case, the start address of square should be 16-byte aligned. The width of square
         *  multiply byte number of one pixel should be 16-byte aligned.
         *
         *  2D-DMA w/ flash encryption enabled can still work properly even if this bit is not set to 1
         *  Meanwhile, enabling this bit will restrict addr and size in internal RAM also has to be 16-byte aligned
         *  Therefore, this bit is not used.
         */
        uint32_t out_ecc_aes_en_chn:1;
        /** out_check_owner_chn : R/W; bitpos: [4]; default: 0;
         *  Set this bit to enable checking the owner attribute of the link descriptor.
         */
        uint32_t out_check_owner_chn:1;
        /** out_loop_test_chn : R/W; bitpos: [5]; default: 0;
         *  reserved
         */
        uint32_t out_loop_test_chn:1;
        /** out_mem_burst_length_chn : R/W; bitpos: [8:6]; default: 0;
         *  Block size of Tx channel 0. 0: single      1: 16 bytes      2: 32 bytes    3: 64
         *  bytes    4: 128 bytes
         */
        uint32_t out_mem_burst_length_chn:3;
        /** out_macro_block_size_chn : R/W; bitpos: [10:9]; default: 0;
         *  Sel TX macro-block size 0: 8pixel*8pixel     1: 8pixel*16pixel     2:
         *  16pixel*16pixel     3: no macro-block     , only useful in mode 1 of the link
         *  descriptor
         */
        uint32_t out_macro_block_size_chn:2;
        /** out_dscr_port_en_chn : R/W; bitpos: [11]; default: 0;
         *  Set this bit to 1 to obtain descriptor from IP port
         */
        uint32_t out_dscr_port_en_chn:1;
        /** out_page_bound_en_chn : R/W; bitpos: [12]; default: 0;
         *  Set this bit to 1 to make sure AXI read data don't cross the address boundary which
         *  define by mem_burst_length
         */
        uint32_t out_page_bound_en_chn:1;
        uint32_t reserved_13:3;
        /** out_reorder_en_chn : R/W; bitpos: [16]; default: 0;
         *  Enable TX channel 0 macro block reorder when set to 1, only channel0 have this
         *  selection
         */
        uint32_t out_reorder_en_chn:1;
        uint32_t reserved_17:7;
        /** out_rst_chn : R/W; bitpos: [24]; default: 0;
         *  Write 1 then write 0 to this bit to reset TX channel
         */
        uint32_t out_rst_chn:1;
        /** out_cmd_disable_chn : R/W; bitpos: [25]; default: 0;
         *  Write 1 before reset and write 0 after reset
         */
        uint32_t out_cmd_disable_chn:1;
        /** out_arb_weight_opt_dis_chn : R/W; bitpos: [26]; default: 0;
         *  Set this bit to 1 to disable arbiter optimum weight function.
         */
        uint32_t out_arb_weight_opt_dis_chn:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} dma2d_out_conf0_chn_reg_t;

/** Type of out_push_chn register
 *  Configures the tx fifo of channel n
 */
typedef union {
    struct {
        /** outfifo_wdata_chn : R/W; bitpos: [9:0]; default: 0;
         *  This register stores the data that need to be pushed into DMA Tx FIFO.
         */
        uint32_t outfifo_wdata_chn:10;
        /** outfifo_push_chn : R/W/SC; bitpos: [10]; default: 0;
         *  Set this bit to push data into DMA Tx FIFO.
         */
        uint32_t outfifo_push_chn:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} dma2d_out_push_chn_reg_t;

/** Type of out_link_conf_chn register
 *  Configures the tx descriptor operations of channel n
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** outlink_stop_chn : R/W/SC; bitpos: [20]; default: 0;
         *  Set this bit to stop dealing with the outlink descriptors.
         */
        uint32_t outlink_stop_chn:1;
        /** outlink_start_chn : R/W/SC; bitpos: [21]; default: 0;
         *  Set this bit to start dealing with the outlink descriptors.
         */
        uint32_t outlink_start_chn:1;
        /** outlink_restart_chn : R/W/SC; bitpos: [22]; default: 0;
         *  Set this bit to restart a new outlink from the last address.
         */
        uint32_t outlink_restart_chn:1;
        /** outlink_park_chn : RO; bitpos: [23]; default: 1;
         *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
         *  is working.
         */
        uint32_t outlink_park_chn:1;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} dma2d_out_link_conf_chn_reg_t;

/** Type of out_link_addr_chn register
 *  Configures the tx descriptor address of channel n
 */
typedef union {
    struct {
        /** outlink_addr_chn : R/W; bitpos: [31:0]; default: 0;
         *  This register stores the first outlink descriptor's address.
         */
        uint32_t outlink_addr_chn:32;
    };
    uint32_t val;
} dma2d_out_link_addr_chn_reg_t;

/** Type of out_arb_chn register
 *  Configures the tx arbiter of channel n
 */
typedef union {
    struct {
        /** out_arb_token_num_chn : R/W; bitpos: [3:0]; default: 0;
         *  Set the max number of token count of arbiter
         */
        uint32_t out_arb_token_num_chn:4;
        /** out_arb_priority_chn : R/W; bitpos: [7:4]; default: 0;
         *  Set the priority of channel
         */
        uint32_t out_arb_priority_chn:4;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} dma2d_out_arb_chn_reg_t;

/** Type of out_ro_pd_conf_chn register
 *  Configures the tx reorder memory of channel 0
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** out_ro_ram_force_pd_chn : R/W; bitpos: [4]; default: 1;
         *  unused! dma reorder ram power down
         */
        uint32_t out_ro_ram_force_pd_chn:1;
        /** out_ro_ram_force_pu_chn : R/W; bitpos: [5]; default: 0;
         *  unused! dma reorder ram power up
         */
        uint32_t out_ro_ram_force_pu_chn:1;
        /** out_ro_ram_clk_fo_chn : R/W; bitpos: [6]; default: 0;
         *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA.
         *  0: A gate-clock will be used when accessing the RAM in DMA.
         */
        uint32_t out_ro_ram_clk_fo_chn:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} dma2d_out_ro_pd_conf_chn_reg_t;

/** Type of out_color_convert_chn register
 *  Configures the tx color convert of channel n
 */
typedef union {
    struct {
        /** out_color_output_sel_chn : R/W; bitpos: [1:0]; default: 0;
         *  Set final color convert process and output type    0: RGB888 to RGB565     1:
         *  YUV444 to YUV422     2: output directly
         */
        uint32_t out_color_output_sel_chn:2;
        /** out_color_3b_proc_en_chn : R/W; bitpos: [2]; default: 0;
         *  Enable generic color convert module between color input & color output, need to
         *  configure parameter.
         */
        uint32_t out_color_3b_proc_en_chn:1;
        /** out_color_input_sel_chn : R/W; bitpos: [5:3]; default: 7;
         *  Set first color convert process and input color type    0: RGB565 to RGB888     1:
         *  YUV422 to YUV444      2: Other 2byte/pixel type    3: Other 3byte/pixel type    7:
         *  disable color space convert
         */
        uint32_t out_color_input_sel_chn:3;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} dma2d_out_color_convert_chn_reg_t;

