espressif/esp-idf/components/soc/esp32s31/register/soc/dma2d_struct.h
/** Type of in_pop_chn register
 *  Configures the rx fifo of channel n
 */
typedef union {
    struct {
        /** infifo_rdata_chn : RO; bitpos: [10:0]; default: 1024;
         *  This register stores the data popping from DMA Rx FIFO.
         */
        uint32_t infifo_rdata_chn:11;
        /** infifo_pop_chn : R/W/SC; bitpos: [11]; default: 0;
         *  Set this bit to pop data from DMA Rx FIFO.
         */
        uint32_t infifo_pop_chn:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} dma2d_in_pop_chn_reg_t;

/** Type of in_link_conf_chn register
 *  Configures the rx descriptor operations of channel n
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** inlink_auto_ret_chn : R/W; bitpos: [20]; default: 1;
         *  Set this bit to return to current inlink descriptor's address, when there are some
         *  errors in current receiving data.
         */
        uint32_t inlink_auto_ret_chn:1;
        /** inlink_stop_chn : R/W/SC; bitpos: [21]; default: 0;
         *  Set this bit to stop dealing with the inlink descriptors.
         */
        uint32_t inlink_stop_chn:1;
        /** inlink_start_chn : R/W/SC; bitpos: [22]; default: 0;
         *  Set this bit to start dealing with the inlink descriptors.
         */
        uint32_t inlink_start_chn:1;
        /** inlink_restart_chn : R/W/SC; bitpos: [23]; default: 0;
         *  Set this bit to mount a new inlink descriptor.
         */
        uint32_t inlink_restart_chn:1;
        /** inlink_park_chn : RO; bitpos: [24]; default: 1;
         *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
         *  working.
         */
        uint32_t inlink_park_chn:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} dma2d_in_link_conf_chn_reg_t;

/** Type of in_link_addr_chn register
 *  Configures the rx descriptor address of channel n
 */
typedef union {
    struct {
        /** inlink_addr_chn : R/W; bitpos: [31:0]; default: 0;
         *  This register stores the first inlink descriptor's address.
         */
        uint32_t inlink_addr_chn:32;
    };
    uint32_t val;
} dma2d_in_link_addr_chn_reg_t;

/** Type of in_arb_chn register
 *  Configures the rx arbiter of channel n
 */
typedef union {
    struct {
        /** in_arb_token_num_chn : R/W; bitpos: [3:0]; default: 0;
         *  Set the max number of token count of arbiter
         */
        uint32_t in_arb_token_num_chn:4;
        /** in_arb_priority_chn : R/W; bitpos: [7:4]; default: 0;
         *  Set the priority of channel
         */
        uint32_t in_arb_priority_chn:4;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} dma2d_in_arb_chn_reg_t;

/** Type of in_ro_pd_conf_chn register
 *  Configures the rx reorder memory of channel 0
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** in_ro_ram_force_pd_chn : R/W; bitpos: [4]; default: 1;
         *  unused! dma reorder ram power down
         */
        uint32_t in_ro_ram_force_pd_chn:1;
        /** in_ro_ram_force_pu_chn : R/W; bitpos: [5]; default: 0;
         *  unused! dma reorder ram power up
         */
        uint32_t in_ro_ram_force_pu_chn:1;
        /** in_ro_ram_clk_fo_chn : R/W; bitpos: [6]; default: 0;
         *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA.
         *  0: A gate-clock will be used when accessing the RAM in DMA.
         */
        uint32_t in_ro_ram_clk_fo_chn:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} dma2d_in_ro_pd_conf_chn_reg_t;

/** Type of in_color_convert_chn register
 *  Configures the Rx color convert of channel 0
 */
typedef union {
    struct {
        /** in_color_output_sel_chn : R/W; bitpos: [1:0]; default: 0;
         *  Set final color convert process and output type    0: RGB888 to RGB565     1:
         *  output directly     2: YUV444 to YUV422    3: YUV444 to YUV420
         */
        uint32_t in_color_output_sel_chn:2;
        /** in_color_3b_proc_en_chn : R/W; bitpos: [2]; default: 0;
         *  Enable generic color convert module between color input & color output, need to
         *  configure parameter.
         */
        uint32_t in_color_3b_proc_en_chn:1;
        /** in_color_input_sel_chn : R/W; bitpos: [5:3]; default: 7;
         *  Set first color convert process and input color type    0: YUV422/420 to YUV444
         *  1: YUV422      2: YUV444/420      7: disable color space convert
         */
        uint32_t in_color_input_sel_chn:3;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} dma2d_in_color_convert_chn_reg_t;

/** Type of in_scramble_chn register
 *  Configures the rx scramble of channel 0
 */
typedef union {
    struct {
        /** in_scramble_sel_pre_chn : R/W; bitpos: [2:0]; default: 0;
         *  Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 :
         *  BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
         */
        uint32_t in_scramble_sel_pre_chn:3;
        /** in_scramble_sel_post_chn : R/W; bitpos: [5:3]; default: 0;
         *  Scramble data after color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 : BYTE1-0-2
         *  3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
         */
        uint32_t in_scramble_sel_post_chn:3;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} dma2d_in_scramble_chn_reg_t;

/** Type of in_color_param0_chn register
 *  Configures the rx color convert parameter of channel 0
 */
typedef union {
    struct {
        /** in_color_param_h0_chn : R/W; bitpos: [20:0]; default: 298;
         *  Set first 2 parameter of most significant byte of pending 3 bytes
         */
        uint32_t in_color_param_h0_chn:21;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dma2d_in_color_param0_chn_reg_t;

/** Type of in_color_param1_chn register
 *  Configures the rx color convert parameter of channel 0
 */
typedef union {
    struct {
        /** in_color_param_h1_chn : R/W; bitpos: [27:0]; default: 210164121;
         *  Set last 2 parameter of most significant byte of pending 3 bytes
         */
        uint32_t in_color_param_h1_chn:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dma2d_in_color_param1_chn_reg_t;

