espressif/esp-idf/components/soc/esp32s31/register/soc/dma2d_struct.h
/** Type of in_color_param2_chn register
 *  Configures the rx color convert parameter of channel 0
 */
typedef union {
    struct {
        /** in_color_param_m0_chn : R/W; bitpos: [20:0]; default: 1995050;
         *  Set first 2 parameter of midium significant byte of pending 3 bytes
         */
        uint32_t in_color_param_m0_chn:21;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dma2d_in_color_param2_chn_reg_t;

/** Type of in_color_param3_chn register
 *  Configures the rx color convert parameter of channel 0
 */
typedef union {
    struct {
        /** in_color_param_m1_chn : R/W; bitpos: [27:0]; default: 35540784;
         *  Set last 2 parameter of midium significant byte of pending 3 bytes
         */
        uint32_t in_color_param_m1_chn:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dma2d_in_color_param3_chn_reg_t;

/** Type of in_color_param4_chn register
 *  Configures the rx color convert parameter of channel 0
 */
typedef union {
    struct {
        /** in_color_param_l0_chn : R/W; bitpos: [20:0]; default: 528682;
         *  Set first 2 parameter of least significant byte of pending 3 bytes
         */
        uint32_t in_color_param_l0_chn:21;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} dma2d_in_color_param4_chn_reg_t;

/** Type of in_color_param5_chn register
 *  Configures the rx color convert parameter of channel 0
 */
typedef union {
    struct {
        /** in_color_param_l1_chn : R/W; bitpos: [27:0]; default: 195899392;
         *  Set last 2 parameter of least significant byte of pending 3 bytes
         */
        uint32_t in_color_param_l1_chn:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dma2d_in_color_param5_chn_reg_t;

/** Type of in_etm_conf_chn register
 *  Configures the rx etm of channel n
 */
typedef union {
    struct {
        /** in_etm_en_chn : R/W; bitpos: [0]; default: 0;
         *  Configures the enable of the etm function, 1 is enable.
         */
        uint32_t in_etm_en_chn:1;
        /** in_etm_loop_en_chn : R/W; bitpos: [1]; default: 0;
         *  Configures the enable of the descriptors loop etm function, 1 is enable.
         */
        uint32_t in_etm_loop_en_chn:1;
        /** in_dscr_task_mak_chn : R/W; bitpos: [3:2]; default: 1;
         *  Configures the maximum number of cacheable descriptors.
         */
        uint32_t in_dscr_task_mak_chn:2;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dma2d_in_etm_conf_chn_reg_t;

/** Type of rst_conf register
 *  Configures the reset of axi
 */
typedef union {
    struct {
        /** axim_rd_rst : R/W; bitpos: [0]; default: 0;
         *  Write 1 then write 0  to this bit to reset axi master read data FIFO.
         */
        uint32_t axim_rd_rst:1;
        /** axim_wr_rst : R/W; bitpos: [1]; default: 0;
         *  Write 1 then write 0  to this bit to reset axi master write data FIFO.
         */
        uint32_t axim_wr_rst:1;
        /** clk_en : R/W; bitpos: [2]; default: 0;
         *  1'h1: Force clock on for register. 1'h0: Support clock only when application writes
         *  registers.
         */
        uint32_t clk_en:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} dma2d_rst_conf_reg_t;

/** Type of intr_mem_start_addr register
 *  The start address of accessible address space.
 */
typedef union {
    struct {
        /** access_intr_mem_start_addr : R/W; bitpos: [31:0]; default: 0;
         *  The start address of accessible address space.
         */
        uint32_t access_intr_mem_start_addr:32;
    };
    uint32_t val;
} dma2d_intr_mem_start_addr_reg_t;

/** Type of intr_mem_end_addr register
 *  The end address of accessible address space.
 */
typedef union {
    struct {
        /** access_intr_mem_end_addr : R/W; bitpos: [31:0]; default: 4294967295;
         *  The end address of accessible address space. The access address beyond this range
         *  would lead to descriptor error.
         */
        uint32_t access_intr_mem_end_addr:32;
    };
    uint32_t val;
} dma2d_intr_mem_end_addr_reg_t;

/** Type of extr_mem_start_addr register
 *  The start address of accessible address space.
 */
typedef union {
    struct {
        /** access_extr_mem_start_addr : R/W; bitpos: [31:0]; default: 0;
         *  The start address of accessible address space.
         */
        uint32_t access_extr_mem_start_addr:32;
    };
    uint32_t val;
} dma2d_extr_mem_start_addr_reg_t;

/** Type of extr_mem_end_addr register
 *  The end address of accessible address space.
 */
typedef union {
    struct {
        /** access_extr_mem_end_addr : R/W; bitpos: [31:0]; default: 4294967295;
         *  The end address of accessible address space. The access address beyond this range
         *  would lead to descriptor error.
         */
        uint32_t access_extr_mem_end_addr:32;
    };
    uint32_t val;
} dma2d_extr_mem_end_addr_reg_t;

/** Type of out_arb_config register
 *  Configures the tx arbiter
 */
typedef union {
    struct {
        /** out_arb_timeout_num : R/W; bitpos: [15:0]; default: 0;
         *  Set the max number of timeout count of arbiter
         */
        uint32_t out_arb_timeout_num:16;
        /** out_weight_en : R/W; bitpos: [16]; default: 0;
         *  reserved
         */
        uint32_t out_weight_en:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} dma2d_out_arb_config_reg_t;

/** Type of in_arb_config register
 *  Configures the rx arbiter
 */
typedef union {
    struct {
        /** in_arb_timeout_num : R/W; bitpos: [15:0]; default: 0;
         *  Set the max number of timeout count of arbiter
         */
        uint32_t in_arb_timeout_num:16;
        /** in_weight_en : R/W; bitpos: [16]; default: 0;
         *  reserved
         */
        uint32_t in_weight_en:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} dma2d_in_arb_config_reg_t;

/** Type of rdn_result register
 *  reserved
 */
typedef union {
    struct {
        /** rdn_ena : R/W; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t rdn_ena:1;
        /** rdn_result : RO; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t rdn_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} dma2d_rdn_result_reg_t;

/** Type of rdn_eco_high register
 *  reserved
 */
typedef union {
    struct {
        /** rdn_eco_high : R/W; bitpos: [31:0]; default: 4294967295;
         *  The start address of accessible address space.
         */
        uint32_t rdn_eco_high:32;
    };
    uint32_t val;
} dma2d_rdn_eco_high_reg_t;

/** Type of rdn_eco_low register
 *  reserved
 */
typedef union {
    struct {
        /** rdn_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  The start address of accessible address space.
         */
        uint32_t rdn_eco_low:32;
    };
    uint32_t val;
} dma2d_rdn_eco_low_reg_t;


/** Group: Interrupt Registers */
/** Type of out_int_raw_chn register
 *  Raw interrupt status of TX channel n
 */
typedef union {
    struct {
        /** out_done_chn_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one outlink
         *  descriptor has been transmitted to peripherals for Tx channel 0.
         */
        uint32_t out_done_chn_int_raw:1;
        /** out_eof_chn_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one outlink
         *  descriptor has been read from memory for Tx channel 0.
         */
        uint32_t out_eof_chn_int_raw:1;
        /** out_dscr_err_chn_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt bit turns to high level when detecting outlink descriptor error,
         *  including owner error, the second and third word error of outlink descriptor for Tx
         *  channel 0.
         */
        uint32_t out_dscr_err_chn_int_raw:1;
        /** out_total_eof_chn_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt bit turns to high level when data corresponding a outlink
         *  (includes one link descriptor or few link descriptors) is transmitted out for Tx
         *  channel 0.
         */
        uint32_t out_total_eof_chn_int_raw:1;
        /** outfifo_ovf_l1_chn_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is overflow.
         */
        uint32_t outfifo_ovf_l1_chn_int_raw:1;
        /** outfifo_udf_l1_chn_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is underflow.
         */
        uint32_t outfifo_udf_l1_chn_int_raw:1;
        /** outfifo_ovf_l2_chn_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is overflow.
         */
        uint32_t outfifo_ovf_l2_chn_int_raw:1;
        /** outfifo_udf_l2_chn_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is underflow.
         */
        uint32_t outfifo_udf_l2_chn_int_raw:1;
        /** outfifo_ovf_l3_chn_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is overflow.
         */
        uint32_t outfifo_ovf_l3_chn_int_raw:1;
        /** outfifo_udf_l3_chn_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is underflow.
         */
        uint32_t outfifo_udf_l3_chn_int_raw:1;
        /** outfifo_ro_ovf_chn_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The raw interrupt bit turns to high level when reorder fifo is overflow.
         */
        uint32_t outfifo_ro_ovf_chn_int_raw:1;
        /** outfifo_ro_udf_chn_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw interrupt bit turns to high level when reorder fifo is underflow.
         */
        uint32_t outfifo_ro_udf_chn_int_raw:1;
        /** out_dscr_task_ovf_chn_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
         */
        uint32_t out_dscr_task_ovf_chn_int_raw:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} dma2d_out_int_raw_chn_reg_t;

/** Type of out_int_ena_chn register
 *  Interrupt enable bits of TX channel n
 */
typedef union {
    struct {
        /** out_done_chn_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit for the OUT_DONE_CH_INT interrupt.
         */
        uint32_t out_done_chn_int_ena:1;
        /** out_eof_chn_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit for the OUT_EOF_CH_INT interrupt.
         */
        uint32_t out_eof_chn_int_ena:1;
        /** out_dscr_err_chn_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t out_dscr_err_chn_int_ena:1;
        /** out_total_eof_chn_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.
         */
        uint32_t out_total_eof_chn_int_ena:1;
        /** outfifo_ovf_l1_chn_int_ena : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l1_chn_int_ena:1;
        /** outfifo_udf_l1_chn_int_ena : R/W; bitpos: [5]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l1_chn_int_ena:1;
        /** outfifo_ovf_l2_chn_int_ena : R/W; bitpos: [6]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l2_chn_int_ena:1;
        /** outfifo_udf_l2_chn_int_ena : R/W; bitpos: [7]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l2_chn_int_ena:1;
        /** outfifo_ovf_l3_chn_int_ena : R/W; bitpos: [8]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l3_chn_int_ena:1;
        /** outfifo_udf_l3_chn_int_ena : R/W; bitpos: [9]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l3_chn_int_ena:1;
        /** outfifo_ro_ovf_chn_int_ena : R/W; bitpos: [10]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_RO_OVF_CH_INT interrupt.
         */
        uint32_t outfifo_ro_ovf_chn_int_ena:1;
        /** outfifo_ro_udf_chn_int_ena : R/W; bitpos: [11]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_RO_UDF_CH_INT interrupt.
         */
        uint32_t outfifo_ro_udf_chn_int_ena:1;
        /** out_dscr_task_ovf_chn_int_ena : R/W; bitpos: [12]; default: 0;
         *  The interrupt enable bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t out_dscr_task_ovf_chn_int_ena:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} dma2d_out_int_ena_chn_reg_t;

/** Type of out_int_st_chn register
 *  Masked interrupt status of TX channel n
 */
typedef union {
    struct {
        /** out_done_chn_int_st : RO; bitpos: [0]; default: 0;
         *  The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.
         */
        uint32_t out_done_chn_int_st:1;
        /** out_eof_chn_int_st : RO; bitpos: [1]; default: 0;
         *  The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.
         */
        uint32_t out_eof_chn_int_st:1;
        /** out_dscr_err_chn_int_st : RO; bitpos: [2]; default: 0;
         *  The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t out_dscr_err_chn_int_st:1;
        /** out_total_eof_chn_int_st : RO; bitpos: [3]; default: 0;
         *  The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.
         */
        uint32_t out_total_eof_chn_int_st:1;
        /** outfifo_ovf_l1_chn_int_st : RO; bitpos: [4]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l1_chn_int_st:1;
        /** outfifo_udf_l1_chn_int_st : RO; bitpos: [5]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l1_chn_int_st:1;
        /** outfifo_ovf_l2_chn_int_st : RO; bitpos: [6]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l2_chn_int_st:1;
        /** outfifo_udf_l2_chn_int_st : RO; bitpos: [7]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l2_chn_int_st:1;
        /** outfifo_ovf_l3_chn_int_st : RO; bitpos: [8]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l3_chn_int_st:1;
        /** outfifo_udf_l3_chn_int_st : RO; bitpos: [9]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l3_chn_int_st:1;
        /** outfifo_ro_ovf_chn_int_st : RO; bitpos: [10]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_RO_OVF_CH_INT interrupt.
         */
        uint32_t outfifo_ro_ovf_chn_int_st:1;
        /** outfifo_ro_udf_chn_int_st : RO; bitpos: [11]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_RO_UDF_CH_INT interrupt.
         */
        uint32_t outfifo_ro_udf_chn_int_st:1;
        /** out_dscr_task_ovf_chn_int_st : RO; bitpos: [12]; default: 0;
         *  The raw interrupt status bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t out_dscr_task_ovf_chn_int_st:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} dma2d_out_int_st_chn_reg_t;

