espressif/esp-idf/components/soc/esp32s31/register/soc/dma2d_struct.h
/** Type of out_int_clr_chn register
 *  Interrupt clear bits of TX channel n
 */
typedef union {
    struct {
        /** out_done_chn_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
         */
        uint32_t out_done_chn_int_clr:1;
        /** out_eof_chn_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
         */
        uint32_t out_eof_chn_int_clr:1;
        /** out_dscr_err_chn_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t out_dscr_err_chn_int_clr:1;
        /** out_total_eof_chn_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
         */
        uint32_t out_total_eof_chn_int_clr:1;
        /** outfifo_ovf_l1_chn_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l1_chn_int_clr:1;
        /** outfifo_udf_l1_chn_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l1_chn_int_clr:1;
        /** outfifo_ovf_l2_chn_int_clr : WT; bitpos: [6]; default: 0;
         *  Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l2_chn_int_clr:1;
        /** outfifo_udf_l2_chn_int_clr : WT; bitpos: [7]; default: 0;
         *  Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l2_chn_int_clr:1;
        /** outfifo_ovf_l3_chn_int_clr : WT; bitpos: [8]; default: 0;
         *  Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l3_chn_int_clr:1;
        /** outfifo_udf_l3_chn_int_clr : WT; bitpos: [9]; default: 0;
         *  Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l3_chn_int_clr:1;
        /** outfifo_ro_ovf_chn_int_clr : WT; bitpos: [10]; default: 0;
         *  Set this bit to clear the OUTFIFO_RO_OVF_CH_INT interrupt.
         */
        uint32_t outfifo_ro_ovf_chn_int_clr:1;
        /** outfifo_ro_udf_chn_int_clr : WT; bitpos: [11]; default: 0;
         *  Set this bit to clear the OUTFIFO_RO_UDF_CH_INT interrupt.
         */
        uint32_t outfifo_ro_udf_chn_int_clr:1;
        /** out_dscr_task_ovf_chn_int_clr : WT; bitpos: [12]; default: 0;
         *  Set this bit to clear the OUT_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t out_dscr_task_ovf_chn_int_clr:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} dma2d_out_int_clr_chn_reg_t;

/** Type of in_int_raw_chn register
 *  Raw interrupt status of RX channel n
 */
typedef union {
    struct {
        /** in_done_chn_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been transmitted to peripherals for Rx channel 0.
         */
        uint32_t in_done_chn_int_raw:1;
        /** in_suc_eof_chn_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been received and no data error is detected for Rx channel 0.
         */
        uint32_t in_suc_eof_chn_int_raw:1;
        /** in_err_eof_chn_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been received and data error is detected
         */
        uint32_t in_err_eof_chn_int_raw:1;
        /** in_dscr_err_chn_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt bit turns to high level when detecting inlink descriptor error,
         *  including owner error, the second and third word error of inlink descriptor for Rx
         *  channel 0.
         */
        uint32_t in_dscr_err_chn_int_raw:1;
        /** infifo_ovf_l1_chn_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
         */
        uint32_t infifo_ovf_l1_chn_int_raw:1;
        /** infifo_udf_l1_chn_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
         */
        uint32_t infifo_udf_l1_chn_int_raw:1;
        /** infifo_ovf_l2_chn_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
         */
        uint32_t infifo_ovf_l2_chn_int_raw:1;
        /** infifo_udf_l2_chn_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
         */
        uint32_t infifo_udf_l2_chn_int_raw:1;
        /** infifo_ovf_l3_chn_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
         */
        uint32_t infifo_ovf_l3_chn_int_raw:1;
        /** infifo_udf_l3_chn_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
         */
        uint32_t infifo_udf_l3_chn_int_raw:1;
        /** in_dscr_empty_chn_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The raw interrupt bit turns to high level when the last descriptor is done but fifo
         *  also remain data.
         */
        uint32_t in_dscr_empty_chn_int_raw:1;
        /** infifo_ro_ovf_chn_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw interrupt bit turns to high level when reorder fifo is overflow.
         */
        uint32_t infifo_ro_ovf_chn_int_raw:1;
        /** infifo_ro_udf_chn_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw interrupt bit turns to high level when reorder fifo is underflow.
         */
        uint32_t infifo_ro_udf_chn_int_raw:1;
        /** in_dscr_task_ovf_chn_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
         */
        uint32_t in_dscr_task_ovf_chn_int_raw:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} dma2d_in_int_raw_chn_reg_t;

/** Type of in_int_ena_chn register
 *  Interrupt enable bits of RX channel n
 */
typedef union {
    struct {
        /** in_done_chn_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_chn_int_ena:1;
        /** in_suc_eof_chn_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_chn_int_ena:1;
        /** in_err_eof_chn_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.
         */
        uint32_t in_err_eof_chn_int_ena:1;
        /** in_dscr_err_chn_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t in_dscr_err_chn_int_ena:1;
        /** infifo_ovf_l1_chn_int_ena : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l1_chn_int_ena:1;
        /** infifo_udf_l1_chn_int_ena : R/W; bitpos: [5]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_udf_l1_chn_int_ena:1;
        /** infifo_ovf_l2_chn_int_ena : R/W; bitpos: [6]; default: 0;
         *  The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l2_chn_int_ena:1;
        /** infifo_udf_l2_chn_int_ena : R/W; bitpos: [7]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t infifo_udf_l2_chn_int_ena:1;
        /** infifo_ovf_l3_chn_int_ena : R/W; bitpos: [8]; default: 0;
         *  The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l3_chn_int_ena:1;
        /** infifo_udf_l3_chn_int_ena : R/W; bitpos: [9]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t infifo_udf_l3_chn_int_ena:1;
        /** in_dscr_empty_chn_int_ena : R/W; bitpos: [10]; default: 0;
         *  The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.
         */
        uint32_t in_dscr_empty_chn_int_ena:1;
        /** infifo_ro_ovf_chn_int_ena : R/W; bitpos: [11]; default: 0;
         *  The interrupt enable bit for the INFIFO_RO_OVF_CH_INT interrupt.
         */
        uint32_t infifo_ro_ovf_chn_int_ena:1;
        /** infifo_ro_udf_chn_int_ena : R/W; bitpos: [12]; default: 0;
         *  The interrupt enable bit for the INFIFO_RO_UDF_CH_INT interrupt.
         */
        uint32_t infifo_ro_udf_chn_int_ena:1;
        /** in_dscr_task_ovf_chn_int_ena : R/W; bitpos: [13]; default: 0;
         *  The interrupt enable bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t in_dscr_task_ovf_chn_int_ena:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} dma2d_in_int_ena_chn_reg_t;

/** Type of in_int_st_chn register
 *  Masked interrupt status of RX channel n
 */
typedef union {
    struct {
        /** in_done_chn_int_st : RO; bitpos: [0]; default: 0;
         *  The raw interrupt status bit for the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_chn_int_st:1;
        /** in_suc_eof_chn_int_st : RO; bitpos: [1]; default: 0;
         *  The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_chn_int_st:1;
        /** in_err_eof_chn_int_st : RO; bitpos: [2]; default: 0;
         *  The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.
         */
        uint32_t in_err_eof_chn_int_st:1;
        /** in_dscr_err_chn_int_st : RO; bitpos: [3]; default: 0;
         *  The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t in_dscr_err_chn_int_st:1;
        /** infifo_ovf_l1_chn_int_st : RO; bitpos: [4]; default: 0;
         *  The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l1_chn_int_st:1;
        /** infifo_udf_l1_chn_int_st : RO; bitpos: [5]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_udf_l1_chn_int_st:1;
        /** infifo_ovf_l2_chn_int_st : RO; bitpos: [6]; default: 0;
         *  The raw interrupt status bit for the INFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l2_chn_int_st:1;
        /** infifo_udf_l2_chn_int_st : RO; bitpos: [7]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t infifo_udf_l2_chn_int_st:1;
        /** infifo_ovf_l3_chn_int_st : RO; bitpos: [8]; default: 0;
         *  The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l3_chn_int_st:1;
        /** infifo_udf_l3_chn_int_st : RO; bitpos: [9]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t infifo_udf_l3_chn_int_st:1;
        /** in_dscr_empty_chn_int_st : RO; bitpos: [10]; default: 0;
         *  The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.
         */
        uint32_t in_dscr_empty_chn_int_st:1;
        /** infifo_ro_ovf_chn_int_st : RO; bitpos: [11]; default: 0;
         *  The raw interrupt status bit for the INFIFO_RO_OVF_CH_INT interrupt.
         */
        uint32_t infifo_ro_ovf_chn_int_st:1;
        /** infifo_ro_udf_chn_int_st : RO; bitpos: [12]; default: 0;
         *  The raw interrupt status bit for the INFIFO_RO_UDF_CH_INT interrupt.
         */
        uint32_t infifo_ro_udf_chn_int_st:1;
        /** in_dscr_task_ovf_chn_int_st : RO; bitpos: [13]; default: 0;
         *  The raw interrupt status bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t in_dscr_task_ovf_chn_int_st:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} dma2d_in_int_st_chn_reg_t;

/** Type of in_int_clr_chn register
 *  Interrupt clear bits of RX channel n
 */
typedef union {
    struct {
        /** in_done_chn_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_chn_int_clr:1;
        /** in_suc_eof_chn_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_chn_int_clr:1;
        /** in_err_eof_chn_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.
         */
        uint32_t in_err_eof_chn_int_clr:1;
        /** in_dscr_err_chn_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the INDSCR_ERR_CH_INT interrupt.
         */
        uint32_t in_dscr_err_chn_int_clr:1;
        /** infifo_ovf_l1_chn_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l1_chn_int_clr:1;
        /** infifo_udf_l1_chn_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_udf_l1_chn_int_clr:1;
        /** infifo_ovf_l2_chn_int_clr : WT; bitpos: [6]; default: 0;
         *  Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l2_chn_int_clr:1;
        /** infifo_udf_l2_chn_int_clr : WT; bitpos: [7]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t infifo_udf_l2_chn_int_clr:1;
        /** infifo_ovf_l3_chn_int_clr : WT; bitpos: [8]; default: 0;
         *  Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l3_chn_int_clr:1;
        /** infifo_udf_l3_chn_int_clr : WT; bitpos: [9]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t infifo_udf_l3_chn_int_clr:1;
        /** in_dscr_empty_chn_int_clr : WT; bitpos: [10]; default: 0;
         *  Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.
         */
        uint32_t in_dscr_empty_chn_int_clr:1;
        /** infifo_ro_ovf_chn_int_clr : WT; bitpos: [11]; default: 0;
         *  Set this bit to clear the INFIFO_RO_OVF_CH_INT interrupt.
         */
        uint32_t infifo_ro_ovf_chn_int_clr:1;
        /** infifo_ro_udf_chn_int_clr : WT; bitpos: [12]; default: 0;
         *  Set this bit to clear the INFIFO_RO_UDF_CH_INT interrupt.
         */
        uint32_t infifo_ro_udf_chn_int_clr:1;
        /** in_dscr_task_ovf_chn_int_clr : WT; bitpos: [13]; default: 0;
         *  Set this bit to clear the IN_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t in_dscr_task_ovf_chn_int_clr:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} dma2d_in_int_clr_chn_reg_t;


/** Group: Status Registers */
/** Type of outfifo_status_chn register
 *  Represents the status of the tx fifo of channel n
 */
typedef union {
    struct {
        /** outfifo_full_l2_chn : RO; bitpos: [0]; default: 0;
         *  Tx FIFO full signal for Tx channel 0.
         */
        uint32_t outfifo_full_l2_chn:1;
        /** outfifo_empty_l2_chn : RO; bitpos: [1]; default: 1;
         *  Tx FIFO empty signal for Tx channel 0.
         */
        uint32_t outfifo_empty_l2_chn:1;
        /** outfifo_cnt_l2_chn : RO; bitpos: [5:2]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
         */
        uint32_t outfifo_cnt_l2_chn:4;
        uint32_t reserved_6:1;
        /** out_remain_under_1b_chn : RO; bitpos: [7]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_1b_chn:1;
        /** out_remain_under_2b_chn : RO; bitpos: [8]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_2b_chn:1;
        /** out_remain_under_3b_chn : RO; bitpos: [9]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_3b_chn:1;
        /** out_remain_under_4b_chn : RO; bitpos: [10]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_4b_chn:1;
        /** out_remain_under_5b_chn : RO; bitpos: [11]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_5b_chn:1;
        /** out_remain_under_6b_chn : RO; bitpos: [12]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_6b_chn:1;
        /** out_remain_under_7b_chn : RO; bitpos: [13]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_7b_chn:1;
        /** out_remain_under_8b_chn : RO; bitpos: [14]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_8b_chn:1;
        /** outfifo_full_l1_chn : RO; bitpos: [15]; default: 0;
         *  Tx FIFO full signal for Tx channel 0.
         */
        uint32_t outfifo_full_l1_chn:1;
        /** outfifo_empty_l1_chn : RO; bitpos: [16]; default: 1;
         *  Tx FIFO empty signal for Tx channel 0.
         */
        uint32_t outfifo_empty_l1_chn:1;
        /** outfifo_cnt_l1_chn : RO; bitpos: [21:17]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
         */
        uint32_t outfifo_cnt_l1_chn:5;
        /** outfifo_full_l3_chn : RO; bitpos: [22]; default: 0;
         *  Tx FIFO full signal for Tx channel 0.
         */
        uint32_t outfifo_full_l3_chn:1;
        /** outfifo_empty_l3_chn : RO; bitpos: [23]; default: 1;
         *  Tx FIFO empty signal for Tx channel 0.
         */
        uint32_t outfifo_empty_l3_chn:1;
        /** outfifo_cnt_l3_chn : RO; bitpos: [28:24]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
         */
        uint32_t outfifo_cnt_l3_chn:5;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} dma2d_outfifo_status_chn_reg_t;

/** Type of out_state_chn register
 *  Represents the working status of the tx descriptor of channel n
 */
typedef union {
    struct {
        /** outlink_dscr_addr_chn : RO; bitpos: [17:0]; default: 0;
         *  This register stores the current outlink descriptor's address.
         */
        uint32_t outlink_dscr_addr_chn:18;
        /** out_dscr_state_chn : RO; bitpos: [19:18]; default: 0;
         *  This register stores the current descriptor state machine state.
         */
        uint32_t out_dscr_state_chn:2;
        /** out_state_chn : RO; bitpos: [23:20]; default: 0;
         *  This register stores the current control module state machine state.
         */
        uint32_t out_state_chn:4;
        /** out_reset_avail_chn : RO; bitpos: [24]; default: 1;
         *  This register indicate that if the channel reset is safety.
         */
        uint32_t out_reset_avail_chn:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} dma2d_out_state_chn_reg_t;

/** Type of out_eof_des_addr_chn register
 *  Represents the address associated with the outlink descriptor of channel n
 */
typedef union {
    struct {
        /** out_eof_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the outlink descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t out_eof_des_addr_chn:32;
    };
    uint32_t val;
} dma2d_out_eof_des_addr_chn_reg_t;

