espressif/esp-idf/components/soc/esp32s31/register/soc/dma2d_struct.h
/** Type of out_dscr_chn register
 *  Represents the address associated with the outlink descriptor of channel n
 */
typedef union {
    struct {
        /** outlink_dscr_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the next outlink descriptor address y.
         */
        uint32_t outlink_dscr_chn:32;
    };
    uint32_t val;
} dma2d_out_dscr_chn_reg_t;

/** Type of out_dscr_bf0_chn register
 *  Represents the address associated with the outlink descriptor of channel n
 */
typedef union {
    struct {
        /** outlink_dscr_bf0_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the last outlink descriptor's next address y-1.
         */
        uint32_t outlink_dscr_bf0_chn:32;
    };
    uint32_t val;
} dma2d_out_dscr_bf0_chn_reg_t;

/** Type of out_dscr_bf1_chn register
 *  Represents the address associated with the outlink descriptor of channel n
 */
typedef union {
    struct {
        /** outlink_dscr_bf1_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the second-to-last outlink descriptor's next address y-2.
         */
        uint32_t outlink_dscr_bf1_chn:32;
    };
    uint32_t val;
} dma2d_out_dscr_bf1_chn_reg_t;

/** Type of out_ro_status_chn register
 *  Represents the status of the tx reorder module of channel n
 */
typedef union {
    struct {
        /** outfifo_ro_cnt_chn : RO; bitpos: [5:0]; default: 0;
         *  The register stores the byte number of the data in color convert Tx FIFO for
         *  channel 0.
         */
        uint32_t outfifo_ro_cnt_chn:6;
        /** out_ro_wr_state_chn : RO; bitpos: [7:6]; default: 0;
         *  The register stores the state of read ram of reorder
         */
        uint32_t out_ro_wr_state_chn:2;
        /** out_ro_rd_state_chn : RO; bitpos: [9:8]; default: 0;
         *  The register stores the state of write ram of reorder
         */
        uint32_t out_ro_rd_state_chn:2;
        /** out_pixel_byte_chn : RO; bitpos: [13:10]; default: 0;
         *  the number of bytes contained in a pixel at TX channel     0: 1byte     1: 1.5bytes
         *  2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes
         */
        uint32_t out_pixel_byte_chn:4;
        /** out_burst_block_num_chn : RO; bitpos: [17:14]; default: 0;
         *  the number of macro blocks contained in a burst of data at TX channel
         */
        uint32_t out_burst_block_num_chn:4;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} dma2d_out_ro_status_chn_reg_t;

/** Type of infifo_status_chn register
 *  Represents the status of the rx fifo of channel n
 */
typedef union {
    struct {
        /** infifo_full_l2_chn : RO; bitpos: [0]; default: 0;
         *  Rx FIFO full signal for Rx channel.
         */
        uint32_t infifo_full_l2_chn:1;
        /** infifo_empty_l2_chn : RO; bitpos: [1]; default: 1;
         *  Rx FIFO empty signal for Rx channel.
         */
        uint32_t infifo_empty_l2_chn:1;
        /** infifo_cnt_l2_chn : RO; bitpos: [5:2]; default: 0;
         *  The register stores the byte number of the data in Rx FIFO for Rx channel.
         */
        uint32_t infifo_cnt_l2_chn:4;
        uint32_t reserved_6:1;
        /** in_remain_under_1b_chn : RO; bitpos: [7]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_1b_chn:1;
        /** in_remain_under_2b_chn : RO; bitpos: [8]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_2b_chn:1;
        /** in_remain_under_3b_chn : RO; bitpos: [9]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_3b_chn:1;
        /** in_remain_under_4b_chn : RO; bitpos: [10]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_4b_chn:1;
        /** in_remain_under_5b_chn : RO; bitpos: [11]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_5b_chn:1;
        /** in_remain_under_6b_chn : RO; bitpos: [12]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_6b_chn:1;
        /** in_remain_under_7b_chn : RO; bitpos: [13]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_7b_chn:1;
        /** in_remain_under_8b_chn : RO; bitpos: [14]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_8b_chn:1;
        /** infifo_full_l1_chn : RO; bitpos: [15]; default: 0;
         *  Rx FIFO full signal for Rx channel 0.
         */
        uint32_t infifo_full_l1_chn:1;
        /** infifo_empty_l1_chn : RO; bitpos: [16]; default: 1;
         *  Rx FIFO empty signal for Rx channel 0.
         */
        uint32_t infifo_empty_l1_chn:1;
        /** infifo_cnt_l1_chn : RO; bitpos: [21:17]; default: 0;
         *  The register stores the byte number of the data in Rx FIFO for Rx channel 0.
         */
        uint32_t infifo_cnt_l1_chn:5;
        /** infifo_full_l3_chn : RO; bitpos: [22]; default: 0;
         *  Rx FIFO full signal for Rx channel 0.
         */
        uint32_t infifo_full_l3_chn:1;
        /** infifo_empty_l3_chn : RO; bitpos: [23]; default: 1;
         *  Rx FIFO empty signal for Rx channel 0.
         */
        uint32_t infifo_empty_l3_chn:1;
        /** infifo_cnt_l3_chn : RO; bitpos: [28:24]; default: 0;
         *  The register stores the byte number of the data in Rx FIFO for Rx channel 0.
         */
        uint32_t infifo_cnt_l3_chn:5;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} dma2d_infifo_status_chn_reg_t;

/** Type of in_state_chn register
 *  Represents the working status of the rx descriptor of channel n
 */
typedef union {
    struct {
        /** inlink_dscr_addr_chn : RO; bitpos: [17:0]; default: 0;
         *  This register stores the current inlink descriptor's address.
         */
        uint32_t inlink_dscr_addr_chn:18;
        /** in_dscr_state_chn : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t in_dscr_state_chn:2;
        /** in_state_chn : RO; bitpos: [22:20]; default: 0;
         *  reserved
         */
        uint32_t in_state_chn:3;
        /** in_reset_avail_chn : RO; bitpos: [23]; default: 1;
         *  This register indicate that if the channel reset is safety.
         */
        uint32_t in_reset_avail_chn:1;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} dma2d_in_state_chn_reg_t;

/** Type of in_suc_eof_des_addr_chn register
 *  Represents the address associated with the inlink descriptor of channel n
 */
typedef union {
    struct {
        /** in_suc_eof_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the inlink descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t in_suc_eof_des_addr_chn:32;
    };
    uint32_t val;
} dma2d_in_suc_eof_des_addr_chn_reg_t;

/** Type of in_err_eof_des_addr_chn register
 *  Represents the address associated with the inlink descriptor of channel n
 */
typedef union {
    struct {
        /** in_err_eof_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the inlink descriptor when there are some
         *  errors in current receiving data.
         */
        uint32_t in_err_eof_des_addr_chn:32;
    };
    uint32_t val;
} dma2d_in_err_eof_des_addr_chn_reg_t;

/** Type of in_dscr_chn register
 *  Represents the address associated with the inlink descriptor of channel n
 */
typedef union {
    struct {
        /** inlink_dscr_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the next inlink descriptor address x.
         */
        uint32_t inlink_dscr_chn:32;
    };
    uint32_t val;
} dma2d_in_dscr_chn_reg_t;

/** Type of in_dscr_bf0_chn register
 *  Represents the address associated with the inlink descriptor of channel n
 */
typedef union {
    struct {
        /** inlink_dscr_bf0_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the last inlink descriptor's next address x-1.
         */
        uint32_t inlink_dscr_bf0_chn:32;
    };
    uint32_t val;
} dma2d_in_dscr_bf0_chn_reg_t;

/** Type of in_dscr_bf1_chn register
 *  Represents the address associated with the inlink descriptor of channel n
 */
typedef union {
    struct {
        /** inlink_dscr_bf1_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the second-to-last inlink descriptor's next address x-2.
         */
        uint32_t inlink_dscr_bf1_chn:32;
    };
    uint32_t val;
} dma2d_in_dscr_bf1_chn_reg_t;

/** Type of in_ro_status_chn register
 *  Represents the status of the rx reorder module of channel n
 */
typedef union {
    struct {
        /** infifo_ro_cnt_chn : RO; bitpos: [4:0]; default: 0;
         *  The register stores the byte number of the data in color convert Rx FIFO for
         *  channel 0.
         */
        uint32_t infifo_ro_cnt_chn:5;
        /** in_ro_wr_state_chn : RO; bitpos: [6:5]; default: 0;
         *  The register stores the state of read ram of reorder
         */
        uint32_t in_ro_wr_state_chn:2;
        /** in_ro_rd_state_chn : RO; bitpos: [8:7]; default: 0;
         *  The register stores the state of write ram of reorder
         */
        uint32_t in_ro_rd_state_chn:2;
        /** in_pixel_byte_chn : RO; bitpos: [12:9]; default: 0;
         *  the number of bytes contained in a pixel at RX channel     0: 1byte     1: 1.5bytes
         *  2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes
         */
        uint32_t in_pixel_byte_chn:4;
        /** in_burst_block_num_chn : RO; bitpos: [16:13]; default: 0;
         *  the number of macro blocks contained in a burst of data at RX channel
         */
        uint32_t in_burst_block_num_chn:4;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} dma2d_in_ro_status_chn_reg_t;

/** Type of axi_err register
 *  Represents the status of th axi bus
 */
typedef union {
    struct {
        /** rid_err_cnt : RO; bitpos: [3:0]; default: 0;
         *  AXI read id err cnt
         */
        uint32_t rid_err_cnt:4;
        /** rresp_err_cnt : RO; bitpos: [7:4]; default: 0;
         *  AXI read resp err cnt
         */
        uint32_t rresp_err_cnt:4;
        /** wresp_err_cnt : RO; bitpos: [11:8]; default: 0;
         *  AXI write resp err cnt
         */
        uint32_t wresp_err_cnt:4;
        /** rd_fifo_cnt : RO; bitpos: [14:12]; default: 0;
         *  AXI read cmd fifo remain cmd count
         */
        uint32_t rd_fifo_cnt:3;
        /** rd_bak_fifo_cnt : RO; bitpos: [18:15]; default: 0;
         *  AXI read backup cmd fifo remain cmd count
         */
        uint32_t rd_bak_fifo_cnt:4;
        /** wr_fifo_cnt : RO; bitpos: [21:19]; default: 0;
         *  AXI write cmd fifo remain cmd count
         */
        uint32_t wr_fifo_cnt:3;
        /** wr_bak_fifo_cnt : RO; bitpos: [25:22]; default: 0;
         *  AXI write backup cmd fifo remain cmd count
         */
        uint32_t wr_bak_fifo_cnt:4;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} dma2d_axi_err_reg_t;

/** Type of date register
 *  register version.
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 36725136;
         *  register version.
         */
        uint32_t date:32;
    };
    uint32_t val;
} dma2d_date_reg_t;


