espressif/esp-idf/components/soc/esp32s31/register/soc/dma2d_struct.h
/** Group: Peripheral Select Registers */
/** Type of out_peri_sel_chn register
 *  Configures the tx peripheral of channel n
 */
typedef union {
    struct {
        /** out_peri_sel_chn : R/W; bitpos: [2:0]; default: 7;
         *  This register is used to select peripheral for Tx channel   0:  jpeg     1:
         *  display-1     2: display-2     3: display-3      7: no choose
         */
        uint32_t out_peri_sel_chn:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} dma2d_out_peri_sel_chn_reg_t;

/** Type of in_peri_sel_chn register
 *  Configures the rx peripheral of channel n
 */
typedef union {
    struct {
        /** in_peri_sel_chn : R/W; bitpos: [2:0]; default: 7;
         *  This register is used to select peripheral for Rx channel   0:  jpeg     1:
         *  display-1     2: display-2        7: no choose
         */
        uint32_t in_peri_sel_chn:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} dma2d_in_peri_sel_chn_reg_t;


typedef struct {
    volatile dma2d_out_conf0_chn_reg_t out_conf0_ch0;
    volatile dma2d_out_int_raw_chn_reg_t out_int_raw_ch0;
    volatile dma2d_out_int_ena_chn_reg_t out_int_ena_ch0;
    volatile dma2d_out_int_st_chn_reg_t out_int_st_ch0;
    volatile dma2d_out_int_clr_chn_reg_t out_int_clr_ch0;
    volatile dma2d_outfifo_status_chn_reg_t outfifo_status_ch0;
    volatile dma2d_out_push_chn_reg_t out_push_ch0;
    volatile dma2d_out_link_conf_chn_reg_t out_link_conf_ch0;
    volatile dma2d_out_link_addr_chn_reg_t out_link_addr_ch0;
    volatile dma2d_out_state_chn_reg_t out_state_ch0;
    volatile dma2d_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch0;
    volatile dma2d_out_dscr_chn_reg_t out_dscr_ch0;
    volatile dma2d_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch0;
    volatile dma2d_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch0;
    volatile dma2d_out_peri_sel_chn_reg_t out_peri_sel_ch0;
    volatile dma2d_out_arb_chn_reg_t out_arb_ch0;
    volatile dma2d_out_ro_status_chn_reg_t out_ro_status_ch0;
    volatile dma2d_out_ro_pd_conf_chn_reg_t out_ro_pd_conf_ch0;
    volatile dma2d_out_color_convert_chn_reg_t out_color_convert_ch0;
    volatile dma2d_out_scramble_chn_reg_t out_scramble_ch0;
    volatile dma2d_out_color_param0_chn_reg_t out_color_param0_ch0;
    volatile dma2d_out_color_param1_chn_reg_t out_color_param1_ch0;
    volatile dma2d_out_color_param2_chn_reg_t out_color_param2_ch0;
    volatile dma2d_out_color_param3_chn_reg_t out_color_param3_ch0;
    volatile dma2d_out_color_param4_chn_reg_t out_color_param4_ch0;
    volatile dma2d_out_color_param5_chn_reg_t out_color_param5_ch0;
    volatile dma2d_out_etm_conf_chn_reg_t out_etm_conf_ch0;
    volatile dma2d_out_dscr_port_blk_chn_reg_t out_dscr_port_blk_ch0;
    uint32_t reserved_070[36];
    volatile dma2d_out_conf0_chn_reg_t out_conf0_ch1;
    volatile dma2d_out_int_raw_chn_reg_t out_int_raw_ch1;
    volatile dma2d_out_int_ena_chn_reg_t out_int_ena_ch1;
    volatile dma2d_out_int_st_chn_reg_t out_int_st_ch1;
    volatile dma2d_out_int_clr_chn_reg_t out_int_clr_ch1;
    volatile dma2d_outfifo_status_chn_reg_t outfifo_status_ch1;
    volatile dma2d_out_push_chn_reg_t out_push_ch1;
    volatile dma2d_out_link_conf_chn_reg_t out_link_conf_ch1;
    volatile dma2d_out_link_addr_chn_reg_t out_link_addr_ch1;
    volatile dma2d_out_state_chn_reg_t out_state_ch1;
    volatile dma2d_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch1;
    volatile dma2d_out_dscr_chn_reg_t out_dscr_ch1;
    volatile dma2d_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch1;
    volatile dma2d_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch1;
    volatile dma2d_out_peri_sel_chn_reg_t out_peri_sel_ch1;
    volatile dma2d_out_arb_chn_reg_t out_arb_ch1;
    volatile dma2d_out_ro_status_chn_reg_t out_ro_status_ch1;
    uint32_t reserved_144;
    volatile dma2d_out_color_convert_chn_reg_t out_color_convert_ch1;
    volatile dma2d_out_scramble_chn_reg_t out_scramble_ch1;
    volatile dma2d_out_color_param0_chn_reg_t out_color_param0_ch1;
    volatile dma2d_out_color_param1_chn_reg_t out_color_param1_ch1;
    volatile dma2d_out_color_param2_chn_reg_t out_color_param2_ch1;
    volatile dma2d_out_color_param3_chn_reg_t out_color_param3_ch1;
    volatile dma2d_out_color_param4_chn_reg_t out_color_param4_ch1;
    volatile dma2d_out_color_param5_chn_reg_t out_color_param5_ch1;
    volatile dma2d_out_etm_conf_chn_reg_t out_etm_conf_ch1;
    volatile dma2d_out_dscr_port_blk_chn_reg_t out_dscr_port_blk_ch1;
    uint32_t reserved_170[36];
    volatile dma2d_out_conf0_chn_reg_t out_conf0_ch2;
    volatile dma2d_out_int_raw_chn_reg_t out_int_raw_ch2;
    volatile dma2d_out_int_ena_chn_reg_t out_int_ena_ch2;
    volatile dma2d_out_int_st_chn_reg_t out_int_st_ch2;
    volatile dma2d_out_int_clr_chn_reg_t out_int_clr_ch2;
    volatile dma2d_outfifo_status_chn_reg_t outfifo_status_ch2;
    volatile dma2d_out_push_chn_reg_t out_push_ch2;
    volatile dma2d_out_link_conf_chn_reg_t out_link_conf_ch2;
    volatile dma2d_out_link_addr_chn_reg_t out_link_addr_ch2;
    volatile dma2d_out_state_chn_reg_t out_state_ch2;
    volatile dma2d_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch2;
    volatile dma2d_out_dscr_chn_reg_t out_dscr_ch2;
    volatile dma2d_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch2;
    volatile dma2d_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch2;
    volatile dma2d_out_peri_sel_chn_reg_t out_peri_sel_ch2;
    volatile dma2d_out_arb_chn_reg_t out_arb_ch2;
    volatile dma2d_out_ro_status_chn_reg_t out_ro_status_ch2;
    uint32_t reserved_244;
    volatile dma2d_out_color_convert_chn_reg_t out_color_convert_ch2;
    volatile dma2d_out_scramble_chn_reg_t out_scramble_ch2;
    volatile dma2d_out_color_param0_chn_reg_t out_color_param0_ch2;
    volatile dma2d_out_color_param1_chn_reg_t out_color_param1_ch2;
    volatile dma2d_out_color_param2_chn_reg_t out_color_param2_ch2;
    volatile dma2d_out_color_param3_chn_reg_t out_color_param3_ch2;
    volatile dma2d_out_color_param4_chn_reg_t out_color_param4_ch2;
    volatile dma2d_out_color_param5_chn_reg_t out_color_param5_ch2;
    volatile dma2d_out_etm_conf_chn_reg_t out_etm_conf_ch2;
    volatile dma2d_out_dscr_port_blk_chn_reg_t out_dscr_port_blk_ch2;
    uint32_t reserved_270[36];
    volatile dma2d_out_conf0_chn_reg_t out_conf0_ch3;
    volatile dma2d_out_int_raw_chn_reg_t out_int_raw_ch3;
    volatile dma2d_out_int_ena_chn_reg_t out_int_ena_ch3;
    volatile dma2d_out_int_st_chn_reg_t out_int_st_ch3;
    volatile dma2d_out_int_clr_chn_reg_t out_int_clr_ch3;
    volatile dma2d_outfifo_status_chn_reg_t outfifo_status_ch3;
    volatile dma2d_out_push_chn_reg_t out_push_ch3;
    volatile dma2d_out_link_conf_chn_reg_t out_link_conf_ch3;
    volatile dma2d_out_link_addr_chn_reg_t out_link_addr_ch3;
    volatile dma2d_out_state_chn_reg_t out_state_ch3;
    volatile dma2d_out_eof_des_addr_chn_reg_t out_eof_des_addr_ch3;
    volatile dma2d_out_dscr_chn_reg_t out_dscr_ch3;
    volatile dma2d_out_dscr_bf0_chn_reg_t out_dscr_bf0_ch3;
    volatile dma2d_out_dscr_bf1_chn_reg_t out_dscr_bf1_ch3;
    volatile dma2d_out_peri_sel_chn_reg_t out_peri_sel_ch3;
    volatile dma2d_out_arb_chn_reg_t out_arb_ch3;
    volatile dma2d_out_ro_status_chn_reg_t out_ro_status_ch3;
    uint32_t reserved_344;
    volatile dma2d_out_color_convert_chn_reg_t out_color_convert_ch3;
    volatile dma2d_out_scramble_chn_reg_t out_scramble_ch3;
    volatile dma2d_out_color_param0_chn_reg_t out_color_param0_ch3;
    volatile dma2d_out_color_param1_chn_reg_t out_color_param1_ch3;
    volatile dma2d_out_color_param2_chn_reg_t out_color_param2_ch3;
    volatile dma2d_out_color_param3_chn_reg_t out_color_param3_ch3;
    volatile dma2d_out_color_param4_chn_reg_t out_color_param4_ch3;
    volatile dma2d_out_color_param5_chn_reg_t out_color_param5_ch3;
    volatile dma2d_out_etm_conf_chn_reg_t out_etm_conf_ch3;
    volatile dma2d_out_dscr_port_blk_chn_reg_t out_dscr_port_blk_ch3;
    uint32_t reserved_370[100];
    volatile dma2d_in_conf0_chn_reg_t in_conf0_ch0;
    volatile dma2d_in_int_raw_chn_reg_t in_int_raw_ch0;
    volatile dma2d_in_int_ena_chn_reg_t in_int_ena_ch0;
    volatile dma2d_in_int_st_chn_reg_t in_int_st_ch0;
    volatile dma2d_in_int_clr_chn_reg_t in_int_clr_ch0;
    volatile dma2d_infifo_status_chn_reg_t infifo_status_ch0;
    volatile dma2d_in_pop_chn_reg_t in_pop_ch0;
    volatile dma2d_in_link_conf_chn_reg_t in_link_conf_ch0;
    volatile dma2d_in_link_addr_chn_reg_t in_link_addr_ch0;
    volatile dma2d_in_state_chn_reg_t in_state_ch0;
    volatile dma2d_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch0;
    volatile dma2d_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch0;
    volatile dma2d_in_dscr_chn_reg_t in_dscr_ch0;
    volatile dma2d_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch0;
    volatile dma2d_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch0;
    volatile dma2d_in_peri_sel_chn_reg_t in_peri_sel_ch0;
    volatile dma2d_in_arb_chn_reg_t in_arb_ch0;
    volatile dma2d_in_ro_status_chn_reg_t in_ro_status_ch0;
    volatile dma2d_in_ro_pd_conf_chn_reg_t in_ro_pd_conf_ch0;
    volatile dma2d_in_color_convert_chn_reg_t in_color_convert_ch0;
    volatile dma2d_in_scramble_chn_reg_t in_scramble_ch0;
    volatile dma2d_in_color_param0_chn_reg_t in_color_param0_ch0;
    volatile dma2d_in_color_param1_chn_reg_t in_color_param1_ch0;
    volatile dma2d_in_color_param2_chn_reg_t in_color_param2_ch0;
    volatile dma2d_in_color_param3_chn_reg_t in_color_param3_ch0;
    volatile dma2d_in_color_param4_chn_reg_t in_color_param4_ch0;
    volatile dma2d_in_color_param5_chn_reg_t in_color_param5_ch0;
    volatile dma2d_in_etm_conf_chn_reg_t in_etm_conf_ch0;
    uint32_t reserved_570[36];
    volatile dma2d_in_conf0_chn_reg_t in_conf0_ch1;
    volatile dma2d_in_int_raw_chn_reg_t in_int_raw_ch1;
    volatile dma2d_in_int_ena_chn_reg_t in_int_ena_ch1;
    volatile dma2d_in_int_st_chn_reg_t in_int_st_ch1;
    volatile dma2d_in_int_clr_chn_reg_t in_int_clr_ch1;
    volatile dma2d_infifo_status_chn_reg_t infifo_status_ch1;
    volatile dma2d_in_pop_chn_reg_t in_pop_ch1;
    volatile dma2d_in_link_conf_chn_reg_t in_link_conf_ch1;
    volatile dma2d_in_link_addr_chn_reg_t in_link_addr_ch1;
    volatile dma2d_in_state_chn_reg_t in_state_ch1;
    volatile dma2d_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch1;
    volatile dma2d_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch1;
    volatile dma2d_in_dscr_chn_reg_t in_dscr_ch1;
    volatile dma2d_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch1;
    volatile dma2d_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch1;
    volatile dma2d_in_peri_sel_chn_reg_t in_peri_sel_ch1;
    volatile dma2d_in_arb_chn_reg_t in_arb_ch1;
    volatile dma2d_in_ro_status_chn_reg_t in_ro_status_ch1;
    uint32_t reserved_648[9];
    volatile dma2d_in_etm_conf_chn_reg_t in_etm_conf_ch1;
    uint32_t reserved_670[36];
    volatile dma2d_in_conf0_chn_reg_t in_conf0_ch2;
    volatile dma2d_in_int_raw_chn_reg_t in_int_raw_ch2;
    volatile dma2d_in_int_ena_chn_reg_t in_int_ena_ch2;
    volatile dma2d_in_int_st_chn_reg_t in_int_st_ch2;
    volatile dma2d_in_int_clr_chn_reg_t in_int_clr_ch2;
    volatile dma2d_infifo_status_chn_reg_t infifo_status_ch2;
    volatile dma2d_in_pop_chn_reg_t in_pop_ch2;
    volatile dma2d_in_link_conf_chn_reg_t in_link_conf_ch2;
    volatile dma2d_in_link_addr_chn_reg_t in_link_addr_ch2;
    volatile dma2d_in_state_chn_reg_t in_state_ch2;
    volatile dma2d_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr_ch2;
    volatile dma2d_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr_ch2;
    volatile dma2d_in_dscr_chn_reg_t in_dscr_ch2;
    volatile dma2d_in_dscr_bf0_chn_reg_t in_dscr_bf0_ch2;
    volatile dma2d_in_dscr_bf1_chn_reg_t in_dscr_bf1_ch2;
    volatile dma2d_in_peri_sel_chn_reg_t in_peri_sel_ch2;
    volatile dma2d_in_arb_chn_reg_t in_arb_ch2;
    volatile dma2d_in_ro_status_chn_reg_t in_ro_status_ch2;
    uint32_t reserved_748[9];
    volatile dma2d_in_etm_conf_chn_reg_t in_etm_conf_ch2;
    uint32_t reserved_770[164];
    volatile dma2d_axi_err_reg_t axi_err;
    volatile dma2d_rst_conf_reg_t rst_conf;
    volatile dma2d_intr_mem_start_addr_reg_t intr_mem_start_addr;
    volatile dma2d_intr_mem_end_addr_reg_t intr_mem_end_addr;
    volatile dma2d_extr_mem_start_addr_reg_t extr_mem_start_addr;
    volatile dma2d_extr_mem_end_addr_reg_t extr_mem_end_addr;
    volatile dma2d_out_arb_config_reg_t out_arb_config;
    volatile dma2d_in_arb_config_reg_t in_arb_config;
    volatile dma2d_rdn_result_reg_t rdn_result;
    volatile dma2d_rdn_eco_high_reg_t rdn_eco_high;
    volatile dma2d_rdn_eco_low_reg_t rdn_eco_low;
    volatile dma2d_date_reg_t date;
} dma2d_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(dma2d_dev_t) == 0xa30, "Invalid size of dma2d_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
